tests/stress.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 550
  processor: "./stressFunction.js"
scenarios:
  - flow:
    - function: "generateRandomData"
    - get:
        url: "/api/overview/{{resturant_id}}"
    # - log: "Send a request to /sidebar with id {{ resturant_id }}"